inst/templates/GetOlapData.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:sur="http://tools.rki.de/SurvStat/" xmlns:rki="http://schemas.datacontract.org/2004/07/Rki.SurvStat.WebService.Contracts.Mdx">
   {{>header}}
   <soap:Body>
      <sur:GetOlapData>
         <sur:request>
{{#column_hierarchy}}
<rki:ColumnHierarchy>{{.}}</rki:ColumnHierarchy>
{{/column_hierarchy}}
            <rki:Cube>{{cube}}</rki:Cube>
{{#data_status}}
            <rki:DataStatus>{{.}}</rki:DataStatus>
{{/data_status}}
            {{>hierarchy_filters}}
            <rki:IncludeNullColumns>true</rki:IncludeNullColumns>
            <rki:IncludeNullRows>true</rki:IncludeNullRows>
            <rki:IncludeTotalColumn>false</rki:IncludeTotalColumn>
            <rki:IncludeTotalRow>false</rki:IncludeTotalRow>
            <rki:Language>{{language}}</rki:Language>
            <rki:Measures>{{measure}}</rki:Measures>
{{#row_hierarchy}}
            <rki:RowHierarchy>{{.}}</rki:RowHierarchy>
{{/row_hierarchy}}
         </sur:request>
      </sur:GetOlapData>
   </soap:Body>
</soap:Envelope>
